print("Здравствуйте!\nЯ - бот, который автоматизирует и упрощает работу с документами!\nЯ был разработан студенткой группы ИС-22-1 "
    "специально с целью упрощения монотонной работы, которая забирает огромную кучу времени у преподавателей учреждения, поэтому и смог увидеть этот удивительный цифровой мир, чтобы облегчить работу людям!\nПожалуйста, "
    "выберите одну из следующих команд, чтобы начать работу со мной!\n/help - Помощь, если у вас "
    "возникли трудности\n/tags - Заметки, где и какие тэги нужно использовать для заполнения\n/fill_docx - Заполнить документ!")

print("**Как меня использовать?**\n**Шаг 1.** Нажмите на команду /tags - она даст вам полное представление, какие тэги и в каких документах они используются.\n**Шаг 2.** "
    "После ознакомления с тэгами, воспользуйтесь командой /fill_docx, чтобы загрузить документ, который хотите заполнить с моей помощью!\n**Шаг 3.** "
    "Загрузите шаблон документа. Если у вас нет нужного  документа, можете скачать его [здесь](ссылка).\n**Шаг 4.** "
    "Заполните нужные для документа тэги и отправьте их мне!\n**Шаг 5.** "
    "Теперь стоит немного подождать! Я обработаю ваш документ и отправлю вам заполненный!")

print("Вот какие тэги используются в документах:\n"
    "**Экзаменационная ведомость** - code_group: Код группы, name_group: Наименование группы, student_name: ФИО студента\n"
    "**Аттестационный лист** - code_group: Код группы, student_name: ФИО студента, start_pract: Дата начала практики, end_pract: Дата конца практики, grade: Оценка\n"
    "**Характеристика на студента** - num_course: Номер курса, code_group: Код группы, name_spec: Название специальности, student_name: ФИО студента, "
    "date_birth: Дата рождения студента, adress_student: Адрес проживания студента, fn_student: Имя студента, date: Дата заполнения документа")